'''
Solution: Array, Pointer

從後面開始比較，若nums2比較大則放到nums1最後面，若nums1比較大則將這個值放到後面

General Case
nums1=[1,2,3,0,0,0], m=3
nums2=[2,5,6], n=3
1. 6>3, [1,2,3,0,0,6], n-1=2
2. 5>3, [1,2,3,0,5,6], n-1=1
3. 2<3, [1,2,3,3,5,6], m-1=2
4. 2=2, [1,2,2,3,5,6], m-1=1
5. 2>1, [1,2,2,3,5,6], n-1=0

Edge Case
nums1=[4,7,10,0,0,0,0], m=3
nums2=[2,5,6,8], n=4
1. 8<10, [4,7,10,0,0,0,10], m-1=2
2. 8>7, [4,7,10,0,0,8,10], n-1=3
3. 6<7, [4,7,10,0,7,8,10], m-1=1
4. 6>4, [4,7,10,6,7,8,10], n-1=2
5. 5>4, [4,7,5,6,7,8,10], n-1=1
6. 2<4, [4,4,5,6,7,8,10], m-1=0
7. n=1, m=0, [2,4,5,6,7,8,10]
'''
def merge(nums1, m, nums2, n):
    while m > 0 and n > 0:
        if nums1[m-1] < nums2[n-1]: # 若nums2比較大則放到nums1最後面
            nums1[n+m-1] = nums2[n-1]
            n -= 1
        else: # 若nums1比較大則和最後面互換位置
            nums1[n+m-1] = nums1[m-1]
            m -= 1

    while n > 0:
        nums1[n-1] = nums2[n-1]
        n -= 1
        
print(merge([1,2,3,0,0,0], 3, [2,5,6], 3)) # [1,2,2,3,5,6]

